#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113601976189]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113601976188]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113601976190]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113601976197]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113601976195]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113601976200]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113601976192]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113601976194]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113601976198]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113601976199]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113601976191]
data.sakuracloud_archive.ubuntu_archive: Reading...
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113601947038]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113601976214]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113601976196]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113601976208]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113601976217]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113601976211]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113601976206]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113601976218]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113601976204]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113601976212]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113601976209]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113601976207]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113601976210]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113601976220]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113601976265]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113601976223]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113601976276]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113601976269]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113601976254]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113601976246]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113601976240]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113601976241]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113601976262]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113601976243]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113601976245]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113601976242]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=19950]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601976214" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113601976265" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601976218" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113601976276" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601976217" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113601976269" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113601976196" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113601976223" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976207" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113601976245" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976211" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113601976246" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976204" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113601976254" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976206" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113601976262" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976210" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113601976240" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976212" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113601976241" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976208" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113601976242" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601976209" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113601976243" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601976214",
        ] -> (known after apply)
        id                = "113601976265"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601976218",
        ] -> (known after apply)
        id                = "113601976276"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601976217",
        ] -> (known after apply)
        id                = "113601976269"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks             = [
          - "113601976196",
        ] -> (known after apply)
        id                = "113601976223"
        name              = "k8s-dev-router-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976207",
          - "113601976197",
        ] -> (known after apply)
        id                = "113601976245"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976211",
          - "113601976194",
        ] -> (known after apply)
        id                = "113601976246"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976204",
          - "113601976200",
        ] -> (known after apply)
        id                = "113601976254"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976206",
          - "113601976191",
        ] -> (known after apply)
        id                = "113601976262"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976210",
          - "113601976199",
        ] -> (known after apply)
        id                = "113601976240"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976212",
          - "113601976195",
        ] -> (known after apply)
        id                = "113601976241"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976208",
          - "113601976198",
        ] -> (known after apply)
        id                = "113601976242"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601976209",
          - "113601976192",
        ] -> (known after apply)
        id                = "113601976243"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>